# =============================================
# make 預設執行
# =============================================
resule: main.exe
	./main.exe

# =============================================
# 編譯檔案命令 [tag:cmd]

# tag：檢查是否有檔案
# 冒號後面可以接：
# - 檔案名稱 	-> 檔案有無變動
# - 標籤 	-> 執行該標籤 make 指令

# =============================================
# 連結所有編譯後的檔案產生可執行檔
main.exe: main.o fun.o
	g++ *.o -o main.exe
# 編譯所有cpp檔案
main.o:main.cpp
	g++ -c main.cpp
fun.o:fun.cpp fun.hpp
	g++ -c fun.cpp


# =============================================
# 命令列
# =============================================
# 清理所有編譯的檔案
clean:
	rm -f *.o main
# 編譯程式碼並執行
test:main.exe
	./main.exe
# 僅編譯出可執行檔，並清除緩存
all: main.exe  clean